HW34_2WAY_EDT/ExternalDataProcessors/ПродажиПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ExternalDataProcessor>
		<Properties>
			<Name>ПродажиПоТоварам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExternalDataProcessor>
</MetaDataObject>

HW34_2WAY_EDT/ExternalDataProcessors/ПродажиПоТоварам/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ДатаНачала, ДатаОкончания, Товар)
	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Товар", Товар); 
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания,,
		|		&Товар = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	ИЛИ Номенклатура = &Товар) КАК ПродажиОбороты";	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока ВЫборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Товар - " + Выборка.Номенклатура + ", сумма = " + выборка.Сумма;
		Сообщение.Сообщить();	
		
		
	КонецЦикла
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Товар);
КонецПроцедуры
